app/controllers/addresses_controller.rb

INSERT INTO "addresses" ("city", "street", "neighborhood", "cep", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["city", "tea"], ["street", "teat"], ["neighborhood", "taa"], ["cep", "dasdas"], ["user_id", 1], ["created_at", "2022-06-04 14:40:34.208824"], ["updated_at", "2022-06-04 14:40:34.208824"]]
---
  def create
    @address = Address.new(address_params)
    authorize @address
    @address.user = current_user
    if @address.save!