app/controllers/loan_proposals_controller.rb

  def create
    @loan_proposal = LoanProposal.new(loan_proposal_params)
    @loan_proposal.user = current_user
    @loan_proposal.accepted = "Enviado"
    if @loan_proposal.save
---
INSERT INTO "loan_proposals" ("conditions", "amount", "accepted", "user_id", "created_at", "updated_at", "description") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def accept
    @loan_proposal = LoanProposal.find(params[:id])
    @loan_proposal.accepted = 'Aceito'
    @loan_proposal.save
---
SELECT "loan_proposals".* FROM "loan_proposals" WHERE "loan_proposals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "loan_proposals" SET "accepted" = $1, "updated_at" = $2 WHERE "loan_proposals"."id" = $3  [["accepted", "Aceito"], ["updated_at", "2022-06-04 00:34:27.141606"], ["id", 1]]

  def set_loan_proposal
    @loan_proposal = LoanProposal.find(params[:id])
---
SELECT "loan_proposals".* FROM "loan_proposals" WHERE "loan_proposals"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]