app/controllers/pages_controller.rb

  def profile
    @user = current_user
    @address = Address.new
    @loan_proposals = LoanProposal.all
---
SELECT "loan_proposals".* FROM "loan_proposals"